1s/ERP/Conf/InformationRegisters/Лико_СтатусыЗаявокНаРемонтПоЗакупкамЗапчастей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>Лико_СтатусыЗаявокНаРемонтПоЗакупкамЗапчастей</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Лико_СтатусыЗакупкиЗапчастей</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ЗаявкаНаРемонт</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ТС_ЗаявкаНаРемонтРабочихЦентров</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

1s/ERP/Conf/InformationRegisters/Лико_СтатусыЗаявокНаРемонтПоЗакупкамЗапчастей/Ext/ManagerModule.bsl
#Область ПрограммныйИнтерфейс   

Процедура НовыйСтатус (ЗаявкаНаРемонт,Статус,Дата=Неопределено) Экспорт //+Лико m.shenderov 25.03.2024
	
	УстановитьПривилегированныйРежим(Истина);
	Если Дата=Неопределено Тогда 
		
		Дата=ТекущаяДата();
		
	КонецЕсли;
	
	НаборЗаписей = РегистрыСведений.Лико_СтатусыЗаявокНаРемонтПоЗакупкамЗапчастей.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Период.Установить(Дата);
	НаборЗаписей.Отбор.ЗаявкаНаРемонт.Установить(ЗаявкаНаРемонт); 
	
	Если Статус<>Неопределено Тогда 	
		
		Запись=НаборЗаписей.Добавить();
		Запись.Период=Дата;
		Запись.ЗаявкаНаРемонт=ЗаявкаНаРемонт;
		Запись.Статус=Статус;
		
	КонецЕсли;
	
	
	НаборЗаписей.Записать(Истина);
	
	
КонецПроцедуры //-Лико m.shenderov 25.03.2024

#КонецОбласти
